# لینک سوال
# https://quera.ir/problemset/contest/2659/

# خوندن ورودی و جدا کردنش
line1 = input()
n = int(line1.split(" ")[0])
p = int(line1.split(" ")[1])
q = int(line1.split(" ")[2])

# یه هش مپ برای ذخیره کردن اسم ها و فیلتر کردن اسم های تکرای
acceptd = {}

# یه حلقه که ان بار اجرا میشه و ورودی هارو میگیره و همه کارا رو میکنه
for i in range(n):
    # این ورودی رو میگیره
    name = input()

    # این خط دو تا حرف اول کلمه رو میچسبونه به دوتا حرف آخر و حروف این بین رو میریزه دور
    # مثلا:
    # parisa -> 'pa' + 'sa' -> pasa
    n = name[:p] + name[q*-1:]

    #  این داداشمون هم مقداری که اون بالایی تولید کرده رو میریزه تو اون هش مپ که بالا تعریف کردیم
    # نکته جالب اینه که اینجوری مقادیر تکراری توی هش مپ ثبت نمیشن
    acceptd[n]=True

# اینجا هم که جواب رو پرینت میکنیم که سایت کوئرا بتونه چک کنه
print(len(acceptd))