# لینک سوال
# https://quera.ir/problemset/contest/2659/

# تعداد حروف رو از ورودی میخونیم
# ورودی رو هم که از نوع رشته هست به عدد تبدیل میکنیم
n = int(input())

# خط اول رو از ورودی میخونیم که شامل حروفیه که باید حدس زده بشه
line1 = input()

# خط دوم رو از ورودی میخونیم که حروفی هست که اون یارو حدس زده
line2 = input()

# اینم تعداد غلط هاست که قراره بشماریم و در آخر چاپ کنیم
count = 0

# یه حلقه روی کارکتر های رشته ای که بالا گرفتیم
for i in range(n):

    # اینجا چک میکنیم که حرف درست حدس زده شده یا نه
    if line1[i] != line2[i]:

        # اگه غلط هدس زده شده بود یدونه به متغیر تعداد غلط ها اضافه میکنیم
        count+=1
        
# اینجا هم که تعداد غلط هارو چاپ میکنیم
print(count)